In [1]:
import pandas as pd

# Join and Merge

In Pandas, 
* merge two dataframes on a (set of) columns key to form any combination their rows with the same key value
* join is similar, but the key must be the index

In [2]:
# basic join example 
df1 = pd.DataFrame({'a': [1, 2, 3], 'b': [4, 5, 6]})
df2 = pd.DataFrame({'a': [1, 2, 3], 'c': [7, 8, 9]})
df1.merge(df2, on='a')

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [3]:
# find total value of sales by product using joins 
products = pd.DataFrame({'product_id': [1, 2, 3], 'product_name': ['Abalone', 'Black Cod', 'Cockles']})
prices = pd.DataFrame({'product_id': [1, 2, 3], 'price': [10, 20, 30]})
sales = pd.DataFrame({'product_id': [1, 2, 3], 'sales': [100, 200, 300]})

In [4]:
# first join products and prices
prod_price = products.merge(prices, on='product_id')
prod_price

   product_id product_name  price
0           1      Abalone     10
1           2    Black Cod     20
2           3      Cockles     30

In [5]:
# then join the result with sales
prod_price_sales = prod_price.merge(sales, on='product_id')
prod_price_sales

   product_id product_name  price  sales
0           1      Abalone     10    100
1           2    Black Cod     20    200
2           3      Cockles     30    300

In [6]:
# now calculate the total value of sales
prod_price_sales['total_sales'] = prod_price_sales['price'] * prod_price_sales['sales']
prod_price_sales

   product_id product_name  price  sales  total_sales
0           1      Abalone     10    100         1000
1           2    Black Cod     20    200         4000
2           3      Cockles     30    300         9000

There are many kinds of joins, which control how keys that appear in only one table are handled:
* left join: at least one row per key in the first table
* right join: at least one row per key in the second table
* inner join: only keep rows with records in both tables
* keep at least one row per record in either table

In [7]:
# more complex join example
df1 = pd.DataFrame({'a': [1, 2, 3], 'b': [4, 5, 6]})
df2 = pd.DataFrame({'a': [1, 1, 3, 4], 'c': [7, 8, 9, 10]})
df1.merge(df2, on='a', how='outer')

   a    b     c
0  1  4.0   7.0
1  1  4.0   8.0
2  2  5.0   NaN
3  3  6.0   9.0
4  4  NaN  10.0